tehisain/caravan-ble/c6-hub/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Flash size — ESP32-C6 SuperMini with 16 MB Boya flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y

# Custom partition table (dual-OTA + storage — see partitions.csv)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# USB-Serial-JTAG console — the SuperMini has no external UART bridge
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# BLE — NimBLE observer for bring-up scan
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# OTA — rollback + bundled CA roots
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# OTA does HTTPS from app_main, which needs a much bigger stack than
# the default 3.5 KB (mbedTLS handshake + cert-bundle parse).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=12288

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
